input()
print(sum(map(int,input())))


'''
# 숫자의 합 성공

| 시간 제한 | 메모리 제한 | 제출 | 정답 | 맞힌 사람 | 정답 비율 |
| --- | --- | --- | --- | --- | --- |
| 1 초 | 256 MB | 239512 | 131963 | 108886 | 55.634% |

## 문제

N개의 숫자가 공백 없이 쓰여있다. 이 숫자를 모두 합해서 출력하는 프로그램을 작성하시오.

## 입력

첫째 줄에 숫자의 개수 N (1 ≤ N ≤ 100)이 주어진다. 둘째 줄에 숫자 N개가 공백없이 주어진다.

## 출력

입력으로 주어진 숫자 N개의 합을 출력한다.

## 예제 입력 1

```
1
1

```

## 예제 출력 1

```
1

```

## 예제 입력 2

```
5
54321

```

## 예제 출력 2

```
15

```

## 예제 입력 3

```
25
7000000000000000000000000

```

## 예제 출력 3

```
7

```

## 예제 입력 4

```
11
10987654321

```

## 예제 출력 4

```
46

```

## 출처

- 문제를 만든 사람: [baekjoon](https://www.acmicpc.net/user/baekjoon)
- 데이터를 추가한 사람: [jh05013](https://www.acmicpc.net/user/jh05013)

## 알고리즘 분류

- [수학](https://www.acmicpc.net/problem/tag/124)
- [구현](https://www.acmicpc.net/problem/tag/102)
- [문자열](https://www.acmicpc.net/problem/tag/158)

## 메모
'''